
*** Dumping AST Record Layout
         0 | class Animal
         0 |   int age
           | [sizeof=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class Dog
         0 |   class Animal (base)
         0 |     int age
           | [sizeof=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x1fc83f2c760 <.\example2.cpp:1:1, line:3:1> line:1:7 referenced class Animal definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable trivial literal
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x1fc83f2c878 <col:1, col:7> col:7 implicit class Animal
|-FieldDecl 0x1fc83f2c920 <line:2:5, col:9> col:9 age 'int'
|-CXXConstructorDecl 0x1fc83f65070 <line:1:7> col:7 implicit Animal 'void () noexcept' inline default trivial
|-CXXDestructorDecl 0x1fc83f65158 <col:7> col:7 implicit ~Animal 'void ()' inline default trivial noexcept-unevaluated 0x1fc83f65158
|-CXXConstructorDecl 0x1fc83f65310 <col:7> col:7 implicit constexpr Animal 'void (const Animal &)' inline default trivial noexcept-unevaluated 0x1fc83f65310
| `-ParmVarDecl 0x1fc83f65440 <col:7> col:7 'const Animal &'
`-CXXConstructorDecl 0x1fc83f65530 <col:7> col:7 implicit constexpr Animal 'void (Animal &&)' inline default trivial noexcept-unevaluated 0x1fc83f65530
  `-ParmVarDecl 0x1fc83f65660 <col:7> col:7 'Animal &&'

Layout: <CGRecordLayout
  LLVMType:%class.Animal = type { i32 }
  NonVirtualBaseLLVMType:%class.Animal = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x1fc83f2c990 <.\example2.cpp:4:1, col:28> col:7 referenced class Dog definition
|-DefinitionData pass_in_registers standard_layout trivially_copyable trivial literal
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial needs_implicit
|-public 'Animal'
|-CXXRecordDecl 0x1fc83f2cb30 <col:1, col:7> col:7 implicit class Dog
|-CXXConstructorDecl 0x1fc83f64f40 <col:7> col:7 implicit referenced Dog 'void () noexcept' inline default trivial
|-CXXConstructorDecl 0x1fc83f656e8 <col:7> col:7 implicit constexpr Dog 'void (const Dog &)' inline default trivial noexcept-unevaluated 0x1fc83f656e8
| `-ParmVarDecl 0x1fc83f65a88 <col:7> col:7 'const Dog &'
`-CXXConstructorDecl 0x1fc83f65b70 <col:7> col:7 implicit constexpr Dog 'void (Dog &&)' inline default trivial noexcept-unevaluated 0x1fc83f65b70
  `-ParmVarDecl 0x1fc83f65ca0 <col:7> col:7 'Dog &&'

Layout: <CGRecordLayout
  LLVMType:%class.Dog = type { %class.Animal }
  NonVirtualBaseLLVMType:%class.Dog = type { %class.Animal }
  IsZeroInitializable:1
  BitFields:[
]>
