
*** Dumping AST Record Layout
         0 | class Animal (empty)
           | [sizeof=1, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class Dog (empty)
         0 |   class Animal (base) (empty)
           | [sizeof=1, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x1867548c760 <.\main.cpp:1:1, col:15> col:7 referenced class Animal definition
|-DefinitionData pass_in_registers empty aggregate standard_layout trivially_copyable pod trivial literal has_constexpr_non_copy_move_ctor can_const_default_init
| |-DefaultConstructor exists trivial constexpr defaulted_is_constexpr
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial
|-CXXRecordDecl 0x1867548c878 <col:1, col:7> col:7 implicit class Animal
|-CXXConstructorDecl 0x186754c4fc0 <col:7> col:7 implicit constexpr Animal 'void () noexcept' inline default trivial
|-CXXDestructorDecl 0x186754c50a8 <col:7> col:7 implicit ~Animal 'void ()' inline default trivial noexcept-unevaluated 0x186754c50a8
|-CXXConstructorDecl 0x186754c5260 <col:7> col:7 implicit constexpr Animal 'void (const Animal &)' inline default trivial noexcept-unevaluated 0x186754c5260
| `-ParmVarDecl 0x186754c5390 <col:7> col:7 'const Animal &'
`-CXXConstructorDecl 0x186754c5480 <col:7> col:7 implicit constexpr Animal 'void (Animal &&)' inline default trivial noexcept-unevaluated 0x186754c5480
  `-ParmVarDecl 0x186754c55b0 <col:7> col:7 'Animal &&'

Layout: <CGRecordLayout
  LLVMType:%class.Animal = type { i8 }
  NonVirtualBaseLLVMType:%class.Animal.base = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x1867548c920 <.\main.cpp:2:1, col:28> col:7 referenced class Dog definition
|-DefinitionData pass_in_registers empty standard_layout trivially_copyable trivial literal has_constexpr_non_copy_move_ctor can_const_default_init
| |-DefaultConstructor exists trivial constexpr defaulted_is_constexpr
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial needs_implicit
|-public 'Animal'
|-CXXRecordDecl 0x1867548cac0 <col:1, col:7> col:7 implicit class Dog
|-CXXConstructorDecl 0x186754c4e90 <col:7> col:7 implicit referenced constexpr Dog 'void () noexcept' inline default trivial
|-CXXConstructorDecl 0x186754c5638 <col:7> col:7 implicit constexpr Dog 'void (const Dog &)' inline default trivial noexcept-unevaluated 0x186754c5638
| `-ParmVarDecl 0x186754c5770 <col:7> col:7 'const Dog &'
`-CXXConstructorDecl 0x186754c5a88 <col:7> col:7 implicit constexpr Dog 'void (Dog &&)' inline default trivial noexcept-unevaluated 0x186754c5a88
  `-ParmVarDecl 0x186754c5bc0 <col:7> col:7 'Dog &&'

Layout: <CGRecordLayout
  LLVMType:%class.Dog = type { i8 }
  NonVirtualBaseLLVMType:%class.Dog.base = type {}
  IsZeroInitializable:1
  BitFields:[
]>
